/*
SQLyog Professional v12.08 (64 bit)
MySQL - 5.5.62 : Database - sams
*********************************************************************
*/


/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
usr school;
/*Table structure for table `course` */

DROP TABLE IF EXISTS `course`;

CREATE TABLE `course` (
  `course_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '课程编号',
  `course_name` varchar(20) NOT NULL COMMENT '课程名',
  `course_credit` int(11) NOT NULL COMMENT '学分',
  `course_hours` int(11) NOT NULL COMMENT '学时',
  `course_teacher` varchar(30) NOT NULL COMMENT '任课教师',
  `coursedate` date NOT NULL COMMENT '开课时间',
  PRIMARY KEY (`course_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

/*Data for the table `course` */

insert  into `course`(`course_id`,`course_name`,`course_credit`,`course_hours`,`course_teacher`,`coursedate`) values (1,'C++程序设计教程',3,60,'汪维清','2021-03-02'),(2,'java入门基础',3,60,'肖兴江','2021-02-09'),(3,'计算机组成原理',3,60,'胡继宽','2021-02-09'),(4,'信息检索',2,60,'郑蔚','2021-02-09'),(5,'操作系统原理',4,60,'丁华峰','2021-03-15'),(6,'管理信息系统',4,60,'杜治国','2021-02-11');

/*Table structure for table `role` */

DROP TABLE IF EXISTS `role`;

CREATE TABLE `role` (
  `role_id` int(11) NOT NULL COMMENT '角色编号',
  `role_name` varchar(20) NOT NULL COMMENT '角色名称',
  `role_info` varchar(50) NOT NULL COMMENT '角色信息',
  PRIMARY KEY (`role_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `role` */

insert  into `role`(`role_id`,`role_name`,`role_info`) values (0,'学生','学生查看成绩'),(1,'教师','教师操作'),(2,'管理员','管理员操作');

/*Table structure for table `score` */

DROP TABLE IF EXISTS `score`;

CREATE TABLE `score` (
  `score_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '成绩编号',
  `stu_num` varchar(20) NOT NULL COMMENT '学号',
  `stu_name` varchar(30) NOT NULL COMMENT '姓名',
  `stu_class` varchar(20) NOT NULL COMMENT '班级',
  `course_name` varchar(20) NOT NULL COMMENT '科目',
  `score_grade` double(11,2) NOT NULL COMMENT '成绩',
  `major` varchar(20) NOT NULL COMMENT '专业',
  PRIMARY KEY (`score_id`)
) ENGINE=InnoDB AUTO_INCREMENT=113 DEFAULT CHARSET=utf8;

/*Data for the table `score` */

insert  into `score`(`score_id`,`stu_num`,`stu_name`,`stu_class`,`course_name`,`score_grade`,`major`) values (1,'170340','张三','计科1701','java入门基础',96.50,'计算机'),(2,'170340','张三','计科1701','C++程序设计教程',85.00,'计算机'),(3,'160341','王五','信管1601','java入门基础',62.60,'信息管理与信息系统'),(4,'160341','王五','信管1601','C++程序设计教程',85.00,'信息管理与信息系统'),(5,'170340','张三','计科1701','计算机组成原理',69.00,'计算机'),(6,'170340','张三','计科1701','信息检索',95.00,'计算机'),(7,'170340','张三','计科1701','操作系统原理',89.00,'计算机'),(8,'160341','王五','计科1701','C++程序设计教程',95.00,'计算机'),(9,'160341','王五','信管1601','java入门基础',92.00,'信息管理与信息系统'),(10,'160341','王五','信管1601','计算机组成原理',83.00,'信息管理与信息系统'),(11,'170339','李四','计科1701','java入门基础',78.20,'计算机'),(12,'170339','李四','计科1701','信息检索',98.00,'计算机'),(13,'170339','李四','计科1701','计算机组成原理',76.00,'计算机'),(14,'170339','李四','计科1701','操作系统原理',69.80,'计算机'),(15,'170339','李四','计科1701','C++程序设计教程',89.00,'计算机'),(16,'170343','陈留','计科1701','java入门基础',80.50,'计算机'),(17,'170343','陈留','计科1701','计算机组成原理',83.50,'计算机'),(18,'170343','陈留','计科1701','C++程序设计教程',82.50,'计算机'),(19,'170343','陈留','计科1701','操作系统原理',80.00,'计算机'),(20,'160342','盛祎琛','信管1602','信息检索',95.00,'信息管理与信息系统'),(21,'160342','盛祎琛','信管1602','操作系统原理',85.00,'信息管理与信息系统'),(22,'160342','盛祎琛','信管1602','计算机组成原理',65.00,'信息管理与信息系统'),(23,'160342','盛祎琛','信管1602','java入门基础',95.00,'信息管理与信息系统'),(24,'160343','闫玉平','信管1601','信息检索',90.00,'信息管理与信息系统'),(25,'160343','闫玉平','信管1601','操作系统原理',64.00,'信息管理与信息系统'),(26,'160343','闫玉平','信管1601','计算机组成原理',63.00,'信息管理与信息系统'),(27,'160343','闫玉平','信管1601','java入门基础',70.00,'信息管理与信息系统'),(28,'160344','陈淑婷','信管1601','信息检索',88.00,'信息管理与信息系统'),(29,'160344','陈淑婷','信管1601','操作系统原理',77.00,'信息管理与信息系统'),(30,'160344','陈淑婷','信管1601','计算机组成原理',66.00,'信息管理与信息系统'),(31,'160344','陈淑婷','信管1601','java入门基础',88.00,'信息管理与信息系统'),(32,'160345','周梦琪','信管1601','信息检索',95.50,'信息管理与信息系统'),(33,'160345','周梦琪','信管1601','计算机组成原理',65.50,'信息管理与信息系统'),(34,'160345','周梦琪','信管1601','java入门基础',78.50,'信息管理与信息系统'),(35,'160345','周梦琪','信管1601','操作系统原理',85.50,'信息管理与信息系统'),(36,'160346','曾智','信管1601','信息检索',90.90,'信息管理与信息系统'),(37,'160346','曾智','信管1601','计算机组成原理',98.90,'信息管理与信息系统'),(38,'160346','曾智','信管1601','java入门基础',60.90,'信息管理与信息系统'),(39,'160346','曾智','信管1601','操作系统原理',70.90,'信息管理与信息系统'),(40,'160347','百鬼丸','信管1601','信息检索',85.00,'信息管理与信息系统'),(41,'160347','百鬼丸','信管1601','操作系统原理',65.00,'信息管理与信息系统'),(42,'160347','百鬼丸','信管1601','java入门基础',75.00,'信息管理与信息系统'),(43,'160347','百鬼丸','信管1601','计算机组成原理',95.00,'信息管理与信息系统'),(44,'160348','多罗罗','信管1601','信息检索',65.00,'信息管理与信息系统'),(45,'160349','伊藤健太郎','信管1601','信息检索',95.00,'信息管理与信息系统'),(46,'160350','贺来贤人','信管1601','信息检索',66.00,'信息管理与信息系统'),(47,'160351','服部平次','信管1601','信息检索',88.00,'信息管理与信息系统'),(48,'160352','柯南','信管1601','信息检索',99.00,'信息管理与信息系统'),(49,'170353','时崎狂三','计科1601','java入门基础',96.50,'计算机'),(50,'170354','坂本','计科1601','java入门基础',66.50,'计算机'),(51,'170355','夏瀚宇','计科1601','java入门基础',99.00,'计算机'),(52,'170356','管栎','计科1602','java入门基础',96.00,'计算机'),(53,'170357','连淮伟','计科1602','java入门基础',76.50,'计算机'),(54,'170358','杨芸晴','计科1603','java入门基础',69.00,'计算机'),(55,'170359','赖美云','计科1603','java入门基础',88.00,'计算机'),(56,'170360','灰二','计科1603','java入门基础',96.00,'计算机'),(57,'160352','潘思言','信管1701','信息检索',95.00,'信息管理与信息系统'),(58,'160352','杨皓鹏','信管1701','信息检索',90.00,'信息管理与信息系统'),(59,'160352','王子','信管1701','信息检索',93.50,'信息管理与信息系统'),(60,'160352','宫崎骏','信管1801','信息检索',75.00,'信息管理与信息系统'),(61,'160352','胡春阳','信管1801','信息检索',66.00,'信息管理与信息系统'),(62,'160352','阿云嘎','信管1801','信息检索',78.00,'信息管理与信息系统'),(63,'160352','吴磊','信管1703','信息检索',79.00,'信息管理与信息系统'),(64,'160352','魏大勋','信管1703','信息检索',65.00,'信息管理与信息系统'),(65,'160352','白敬亭','信管1703','信息检索',75.00,'信息管理与信息系统'),(66,'160352','铃屋十造','信管1802','信息检索',65.00,'信息管理与信息系统'),(67,'160348','多罗罗','信管1601','java入门基础',65.00,'信息管理与信息系统'),(68,'160349','伊藤健太郎','信管1601','java入门基础',95.00,'信息管理与信息系统'),(69,'160350','贺来贤人','信管1601','java入门基础',66.00,'信息管理与信息系统'),(70,'160351','服部平次','信管1601','java入门基础',88.00,'信息管理与信息系统'),(71,'160352','柯南','信管1601','java入门基础',99.00,'信息管理与信息系统'),(72,'170353','时崎狂三','计科1601','操作系统原理',96.50,'计算机'),(73,'170354','坂本','计科1601','操作系统原理',66.50,'计算机'),(74,'170355','夏瀚宇','计科1601','操作系统原理',99.00,'计算机'),(75,'170356','管栎','计科1602','操作系统原理',96.00,'计算机'),(76,'170357','连淮伟','计科1602','操作系统原理',76.50,'计算机'),(77,'170358','杨芸晴','计科1603','操作系统原理',69.00,'计算机'),(78,'170359','赖美云','计科1603','操作系统原理',88.00,'计算机'),(79,'170360','灰二','计科1603','操作系统原理',96.00,'计算机'),(80,'160352','潘思言','信管1701','java入门基础',95.00,'信息管理与信息系统'),(81,'160352','杨皓鹏','信管1701','java入门基础',90.00,'信息管理与信息系统'),(82,'160352','王子','信管1701','java入门基础',93.50,'信息管理与信息系统'),(83,'160352','宫崎骏','信管1801','java入门基础',75.00,'信息管理与信息系统'),(84,'160352','胡春阳','信管1801','java入门基础',66.00,'信息管理与信息系统'),(85,'160352','阿云嘎','信管1801','java入门基础',78.00,'信息管理与信息系统'),(86,'160352','吴磊','信管1703','java入门基础',79.00,'信息管理与信息系统'),(87,'160352','魏大勋','信管1703','java入门基础',65.00,'信息管理与信息系统'),(88,'160352','白敬亭','信管1703','java入门基础',75.00,'信息管理与信息系统'),(89,'160352','铃屋十造','信管1802','java入门基础',65.00,'信息管理与信息系统'),(90,'160348','多罗罗','信管1601','计算机组成原理',65.00,'信息管理与信息系统'),(91,'160349','伊藤健太郎','信管1601','计算机组成原理',95.00,'信息管理与信息系统'),(92,'160350','贺来贤人','信管1601','计算机组成原理',66.00,'信息管理与信息系统'),(93,'160351','服部平次','信管1601','计算机组成原理',88.00,'信息管理与信息系统'),(94,'160352','柯南','信管1601','计算机组成原理',99.00,'信息管理与信息系统'),(95,'170353','时崎狂三','计科1601','C++程序设计教程',96.50,'计算机'),(96,'170354','坂本','计科1601','C++程序设计教程',66.50,'计算机'),(97,'170355','夏瀚宇','计科1601','C++程序设计教程',99.00,'计算机'),(98,'170356','管栎','计科1602','C++程序设计教程',96.00,'计算机'),(99,'170357','连淮伟','计科1602','C++程序设计教程',76.50,'计算机'),(100,'170358','杨芸晴','计科1603','C++程序设计教程',69.00,'计算机'),(101,'170359','赖美云','计科1603','C++程序设计教程',88.00,'计算机'),(102,'170360','灰二','计科1603','C++程序设计教程',96.00,'计算机'),(103,'160352','潘思言','信管1701','计算机组成原理',95.00,'信息管理与信息系统'),(104,'160352','杨皓鹏','信管1701','计算机组成原理',90.00,'信息管理与信息系统'),(105,'160352','王子','信管1701','计算机组成原理',93.50,'信息管理与信息系统'),(106,'160352','宫崎骏','信管1801','计算机组成原理',75.00,'信息管理与信息系统'),(107,'160352','胡春阳','信管1801','计算机组成原理',66.00,'信息管理与信息系统'),(108,'160352','阿云嘎','信管1801','计算机组成原理',78.00,'信息管理与信息系统'),(109,'160352','吴磊','信管1703','计算机组成原理',79.00,'信息管理与信息系统'),(110,'160352','魏大勋','信管1703','计算机组成原理',65.00,'信息管理与信息系统'),(111,'160352','白敬亭','信管1703','计算机组成原理',75.00,'信息管理与信息系统'),(112,'160352','铃屋十造','信管1802','计算机组成原理',65.00,'信息管理与信息系统');

/*Table structure for table `student` */

DROP TABLE IF EXISTS `student`;

CREATE TABLE `student` (
  `stu_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `stu_num` varchar(20) NOT NULL COMMENT '账号',
  `stu_name` varchar(30) NOT NULL COMMENT '姓名',
  `stu_sex` varchar(10) NOT NULL COMMENT '性别',
  `stu_age` int(11) NOT NULL COMMENT '年龄',
  `stu_class` varchar(20) NOT NULL COMMENT '班级',
  `major` varchar(20) NOT NULL COMMENT '专业',
  `department` varchar(20) NOT NULL COMMENT '院系',
  PRIMARY KEY (`stu_id`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;

/*Data for the table `student` */

insert  into `student`(`stu_id`,`stu_num`,`stu_name`,`stu_sex`,`stu_age`,`stu_class`,`major`,`department`) values (1,'160341','王五','女',21,'信管1601','信息管理与信息系统','商贸学院'),(2,'170340','张三','男',20,'计科1701','计算机','商贸学院'),(3,'170339','李四','男',20,'计科1701','计算机','商贸学院'),(4,'170343','陈留','男',21,'计科1701','计算机','商贸学院'),(5,'160342','盛祎琛','女',19,'信管1602','信息管理与信息系统','商贸学院'),(6,'160343','闫玉平','女',20,'信管1601','信息管理与信息系统','商贸学院'),(7,'160344','陈淑婷','女',20,'信管1601','信息管理与信息系统','商贸学院'),(8,'160345','周梦琪','女',20,'信管1601','信息管理与信息系统','商贸学院'),(9,'160346','曾智','女',20,'信管1601','信息管理与信息系统','商贸学院'),(10,'160347','百鬼丸','男',20,'信管1601','信息管理与信息系统','商贸学院'),(11,'160348','多罗罗','男',20,'信管1601','信息管理与信息系统','商贸学院'),(12,'160349','伊藤健太郎','男',20,'信管1601','信息管理与信息系统','商贸学院'),(13,'160350','贺来贤人','男',20,'信管1601','信息管理与信息系统','商贸学院'),(14,'160351','服部平次','男',20,'信管1601','信息管理与信息系统','商贸学院'),(15,'160352','柯南','男',20,'信管1601','信息管理与信息系统','商贸学院'),(16,'170353','时崎狂三','女',21,'计科1601','计算机','商贸学院'),(17,'170354','坂本','男',21,'计科1601','计算机','商贸学院'),(18,'170355','夏瀚宇','男',21,'计科1601','计算机','商贸学院'),(19,'170356','管栎','男',21,'计科1602','计算机','商贸学院'),(20,'170357','连淮伟','男',21,'计科1602','计算机','商贸学院'),(21,'170358','杨芸晴','女',21,'计科1603','计算机','商贸学院'),(22,'170359','赖美云','女',21,'计科1603','计算机','商贸学院'),(23,'170360','灰二','男',21,'计科1603','计算机','商贸学院'),(24,'160352','潘思言','男',20,'信管1701','信息管理与信息系统','商贸学院'),(25,'160352','杨皓鹏','男',20,'信管1701','信息管理与信息系统','商贸学院'),(26,'160352','王子','男',20,'信管1701','信息管理与信息系统','商贸学院'),(27,'160352','宫崎骏','男',20,'信管1801','信息管理与信息系统','商贸学院'),(28,'160352','胡春阳','男',20,'信管1801','信息管理与信息系统','商贸学院'),(29,'160352','阿云嘎','男',20,'信管1801','信息管理与信息系统','商贸学院'),(30,'160352','吴磊','男',20,'信管1703','信息管理与信息系统','商贸学院'),(31,'160352','魏大勋','男',20,'信管1703','信息管理与信息系统','商贸学院'),(32,'160352','白敬亭','男',19,'信管1703','信息管理与信息系统','商贸学院'),(33,'160352','铃屋十造','男',18,'信管1802','信息管理与信息系统','商贸学院');

/*Table structure for table `teacher` */

DROP TABLE IF EXISTS `teacher`;

CREATE TABLE `teacher` (
  `tea_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `tea_num` varchar(20) NOT NULL COMMENT '工号',
  `tea_name` varchar(30) NOT NULL COMMENT '姓名',
  `tea_sex` varchar(10) NOT NULL COMMENT '性别',
  `tea_age` int(11) NOT NULL COMMENT '年龄',
  `tea_course` varchar(20) NOT NULL COMMENT '所任课程',
  `major` varchar(20) NOT NULL COMMENT '专业',
  `department` varchar(20) NOT NULL COMMENT '院系',
  PRIMARY KEY (`tea_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

/*Data for the table `teacher` */

insert  into `teacher`(`tea_id`,`tea_num`,`tea_name`,`tea_sex`,`tea_age`,`tea_course`,`major`,`department`) values (1,'1123','肖兴江','男',30,'java入门基础','计算机','商贸学院'),(2,'1124','汪维清','男',25,'C++程序设计教程','计算机','商贸学院'),(3,'1125','胡继宽','男',32,'计算机组成原理','信息管理与信息系统','商贸学院'),(4,'1126','郑蔚','女',34,'信息检索','信息管理与信息系统','商贸学院'),(5,'1127','丁华峰','男',40,'操作系统原理','计算机','商贸学院'),(6,'1128','杜治国','男',35,'管理信息系统','信息管理与信息系统','商贸学院');

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户编号',
  `user_num` varchar(20) NOT NULL COMMENT '用户账号',
  `user_name` varchar(30) NOT NULL COMMENT '用户名',
  `password` varchar(20) NOT NULL COMMENT '密码',
  `phone` varchar(20) NOT NULL COMMENT '用户电话',
  `role_id` int(11) NOT NULL COMMENT '角色编号（外键）',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`user_id`,`user_num`,`user_name`,`password`,`phone`,`role_id`) values (1,'160341','王五','11','14829726746',0),(2,'170340','张三','22','15869483651',0),(3,'170339','李四','33','13589462584',0),(6,'1123','肖兴江','11','17418953551',1),(7,'1124','汪维清','22','15897683584',1),(8,'170343','陈留','123456','12457891862',0),(9,'1125','胡继宽','1125','12378945862',1),(10,'1126','郑蔚','1126','13589462584',1),(11,'1','admin','123','18179586325',2),(12,'1127','丁华峰','11','16123598785',1),(13,'1128','杜治国','11','13158794456',1),(14,'160344','陈淑婷','11','14829726746',0),(15,'160345','周梦琪','11','14829726746',0),(16,'160346','曾智','11','14829726746',0),(17,'160347','百鬼丸','11','14829726746',0),(18,'160348','多罗罗','11','14829726746',0),(19,'160349','伊藤健太郎','11','14829726746',0),(20,'160350','贺来贤人','11','14829726746',0),(21,'170358','杨芸晴','11','14829726746',0),(22,'170359','赖美云','11','14829726746',0),(23,'170360','灰二','11','14829726746',0),(24,'160352','潘思言','11','14829726746',0),(25,'160352','杨皓鹏','11','14829726746',0),(26,'160352','王子','11','14829726746',0),(27,'160352','宫崎骏','11','14829726746',0),(28,'160352','胡春阳','11','14829726746',0),(29,'160352','阿云嘎','11','14829726746',0),(30,'160352','吴磊','11','14829726746',0),(31,'160352','魏大勋','11','14829726746',0),(32,'160352','白敬亭','11','14829726746',0),(33,'160352','铃屋十造','11','14829726746',0),(34,'160351','服部平次','11','14829726746',0),(35,'160352','柯南','11','14829726746',0),(36,'170353','时崎狂三','11','14829726746',0),(37,'170354','坂本','11','14829726746',0),(38,'170355','夏瀚宇','11','14829726746',0),(39,'170356','管栎','11','14829726746',0),(40,'170357','连淮伟','11','14829726746',0);

/* Trigger structure for table `student` */

DELIMITER $$

/*!50003 DROP TRIGGER*//*!50032 IF EXISTS */ /*!50003 `stuLogin` */$$

/*!50003 CREATE */ /*!50017 DEFINER = 'root'@'localhost' */ /*!50003 TRIGGER `stuLogin` AFTER DELETE ON `student` FOR EACH ROW begin 
delete from user where user_num=old.stu_num;
end */$$


DELIMITER ;

/* Trigger structure for table `teacher` */

DELIMITER $$

/*!50003 DROP TRIGGER*//*!50032 IF EXISTS */ /*!50003 `teaLogin` */$$

/*!50003 CREATE */ /*!50017 DEFINER = 'root'@'localhost' */ /*!50003 TRIGGER `teaLogin` AFTER DELETE ON `teacher` FOR EACH ROW begin
delete from user where user_num=old.tea_num;
end */$$


DELIMITER ;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
